.emacs.d/config.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+auto_tangle: t

* Early init
Some early init code to run before everything started.
#+begin_src emacs-lisp :tangle ./early-init.el
  ;; Reduce number of gc at startup
  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq gc-cons-threshold 16777216 ; 16mb
            gc-cons-percentage 0.1)))

  ;; in ~/.emacs.d/init.el (or ~/.emacs.d/early-init.el in Emacs 27)
  (setq package-enable-at-startup nil ; don't auto-initialize!
        ;; don't add that `custom-set-variables' block to my init.el!
        package--init-file-ensured t)

  ;;; Native compilation support (see http://akrl.sdf.org/gccemacs.html)
  (when (boundp 'native-comp-eln-load-path)
    ;; Don't store eln files in ~/.emacs.d/eln-cache
    ;; Use startup-redirect-eln-cache in Emacs 29
    (startup-redirect-eln-cache (expand-file-name (convert-standard-filename "var/eln-cache/")
                                                  user-emacs-directory)))

  (setq package-enable-at-startup nil) ; For Emacs version >= 27
  (setq inhibit-automatic-native-compilation t)

  ;; Integration of straight.el and flycheck.
  (setq straight-fix-flycheck t)

  ;; Disable native-comp warning buffer.
  (setq native-comp-async-report-warnings-errors nil)
#+end_src
* Package Setup
** Straight & use-package
Use straight and use-package to manage packages. These two packages should be loaded before any other files.
#+begin_src emacs-lisp
  ;; Straight.el bootstrap
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package) ; Load use-package
#+end_src
** Startup diagnostic
#+begin_src emacs-lisp
  ;; (setq use-package-compute-statistics t)

  ;; (use-package benchmark-init
  ;;   :straight t
  ;;   :config
  ;;   ;; To disable collection of benchmark data after init is done.
  ;;   (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src
** Auto tangle
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :straight t
    :defer t
    :hook
    (org-mode . org-auto-tangle-mode)
    :config
    (setq org-auto-tangle-babel-safelist '(
                                           "~/.emacs.d/config.org"
                                           )))
#+end_src
** Cleanup
#+begin_src emacs-lisp
  (use-package no-littering
    :straight t
    :config
    (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
    (when (fboundp 'startup-redirect-eln-cache)
      (startup-redirect-eln-cache
       (convert-standard-filename
	(expand-file-name  "var/eln-cache/" user-emacs-directory)))))
#+end_src
** Emacs
#+begin_src emacs-lisp
  (use-package emacs
    :bind
    ("C-c f p" . my/find-file-in-private-config)
    ("C-c q r" . 'restart-emacs)
    :custom
    ;; TAB cycle if there are only few candidates
    (completion-cycle-threshold 3)

    ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
    ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
    (read-extended-command-predicate
     #'command-completion-default-include-p)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    ;; Enable recursive minibuffers
    (enable-recursive-minibuffers t)

    ;; Disable popup confirmations
    (use-dialog-box nil)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Remember and restore the last cursor location of opened files
    ;; (save-place-mode 1)
    ;; (setq save-place-file (concat user-emacs-directory "var/saveplace"))

    ;; Revert buffers when the underlying file has changed
    (global-auto-revert-mode 1)
    :config
    (defalias 'yes-or-no-p 'y-or-n-p)
    ;; Disable auto-save
    (setq auto-save-default nil)
    )
#+end_src
** Magit
#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :bind
    ("C-c v /"   ("Magit dispatch" . magit-dispatch)
     "C-c v ."   ("Magit file dispatch" . magit-file-dispatch)
     "C-c v '"   ("Forge dispatch" . forge-dispatch)
     "C-c v g"   ("Magit status" . magit-status)
     "C-c v G"   ("Magit status here" . magit-status-here)
     "C-c v x"   ("Magit file delete" . magit-file-delete)
     "C-c v B"   ("Magit blame" . magit-blame-addition)
     "C-c v C"   ("Magit clone" . magit-clone)
     "C-c v F"   ("Magit fetch" . magit-fetch)
     "C-c v L"   ("Magit buffer log" . magit-log-buffer-file)
     "C-c v S"   ("Git stage file" . magit-stage-file)
     "C-c v U"   ("Git unstage file" . magit-unstage-file)
     ))
#+end_src
* Completion
** Corfu
Corfu enhances in-buffer completion with a small completion popup. It hooks to ~completion-in-region~ and will show a popup window showing all possible completion candidates based on the context. Corfu is the base for other packages that provide complition inside buffer, so it should be loaded first.
#+begin_src emacs-lisp
  (use-package corfu
    :straight t
    :custom
    (corfu-cycle t)
    (corfu-quit-no-match 'separator)
    (corfu-preselect 'prompt)
    (corfu-auto nil)
    (corfu-auto-delay 0.3)
    (corfu-auto-prefix 0)

    :hook
    (meow-insert-exit . corfu-quit)
    
    :bind
    (:map corfu-map
          ("S-SPC" . corfu-insert-separator)
          ("TAB" . corfu-next)
          ([tab] . corfu-next)
          ("S-TAB" . corfu-previous)
          ([backtab] . corfu-previous))
    
    :init
    (global-corfu-mode)

    :config
    ;; Config for tab-and-go style
    (dolist (c (list (cons "SPC" " ")
                   (cons "," ",")
                   (cons ")" ")")
                   (cons "}" "}")
                   (cons "]" "]")))
    (define-key corfu-map (kbd (car c)) `(lambda ()
                                           (interactive)
                                           (corfu-insert)
                                           (insert ,(cdr c)))))
    )

  ;; Use corfu even in ternimal
  (use-package corfu-terminal
    :straight t
    :after corfu
    :init
    (unless (display-graphic-p)
      (corfu-terminal-mode +1)))

  ;; Show doc of selected candidate
  (use-package corfu-popupinfo
    :load-path "straight/build/corfu/extensions/"
    :hook (corfu-mode . corfu-popupinfo-mode))
#+end_src
*** Icons before candidates
Show icons before corfu candidates. Icons are from svg-lib, and the ~kind-icon-default-style~ depends on what font you are using for candidates.
#+begin_src emacs-lisp
  (use-package svg-lib :straight t)
  (use-package kind-icon
    :straight t
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    (kind-icon-default-style
     '(:padding -1 :stroke 0 :margin 0 :radius 0 :height 0.5 :scale 1.0))
    (kind-icon-blend-background nil)
    :config
    ;; Enable blend background in GUI
    (when (display-graphic-p)
      (setq kind-icon-blend-background t))

    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
    ;; :config
    ;; (add-hook 'corfu-mode-hook
    ;;           (lambda ()
    ;;             (setq completion-in-region-function
    ;;                   (kind-icon-enhance-completion
    ;;                    completion-in-region-function))))
    )
#+end_src
*** Completion At Point Extensions (CAPE)
Cape provides Completion At Point Extensions which can be used in combination with Corfu, Company or the default completion UI. The completion backends used by ~completion-at-point~ are so called ~completion-at-point-functions~ (Capfs).
#+begin_src emacs-lisp
  ;; Add extensions
  (use-package cape
    :straight t
    :after corfu
    ;; Bind dedicated completion commands
    ;; Alternative prefix keys: C-c p, M-p, M-+, ...
    :bind (("M-p p" . completion-at-point) ;; capf
           ("M-p t" . complete-tag)        ;; etags
           ("M-p d" . cape-dabbrev)        ;; or dabbrev-completion
           ("M-p h" . cape-history)
           ("M-p f" . cape-file)
           ("M-p k" . cape-keyword)
           ("M-p s" . cape-symbol)
           ("M-p a" . cape-abbrev)
           ("M-p l" . cape-line)
           ("M-p w" . cape-dict)
           ("M-p \\" . cape-tex)
           ("M-p _" . cape-tex)
           ("M-p ^" . cape-tex)
           ("M-p &" . cape-sgml)
           ("M-p r" . cape-rfc1345))
    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.
    ;; NOTE: The order matters!
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-elisp-block)
    ;;(add-to-list 'completion-at-point-functions #'cape-history)
    ;;(add-to-list 'completion-at-point-functions #'cape-keyword)
    ;;(add-to-list 'completion-at-point-functions #'cape-tex)
    ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
    ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
    ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
    ;;(add-to-list 'completion-at-point-functions #'cape-dict)
    ;;(add-to-list 'completion-at-point-functions #'cape-symbol)
    ;;(add-to-list 'completion-at-point-functions #'cape-line)
    )
#+end_src
** Vertico
Vertico provides a performant and minimalistic vertical completion UI based on the default completion system. Although vertico can be used as ~completion-at-point~, it is only used to complete mini-buffer prompt in this configuration.
#+begin_src emacs-lisp
  (use-package vertico
    :straight t
    :init
    (vertico-mode))
#+end_src
** Orderless
#+begin_src emacs-lisp
  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :straight t
    :config
    (defun orderless-fast-dispatch (word index total)
      (and (= index 0) (= total 1) (length< word 4)
  	 `(orderless-regexp . ,(concat "^" (regexp-quote word)))))

    (orderless-define-completion-style orderless-fast
      (orderless-style-dispatchers '(orderless-fast-dispatch))
      (orderless-matching-styles '(orderless-literal orderless-regexp)))

    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
    ;;       orderless-component-separator #'orderless-escapable-split-on-space)
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
          completion-category-overrides '((file (styles . (partial-completion)))
  					(symbol (styles . (orderless-fast)))))
    )

  ;; Support Pinyin with pinyinlib
  (use-package pinyinlib
    :straight t
    :config
    (defun completion--regex-pinyin (str)
      (orderless-regexp (pinyinlib-build-regexp-string str)))
    (add-to-list 'orderless-matching-styles 'completion--regex-pinyin))
#+end_src
** Marginalia
Marginalia provide additional infos about commands. It integrate with vertico and will show simple docs based on the command's type in vertical layout.
#+begin_src emacs-lisp
  ;; Enable rich annotations using the Marginalia package
  (use-package marginalia
    :straight t
    ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
    ;; available in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map'.
    :bind (:map minibuffer-local-map
           ("M-A" . marginalia-cycle))

    ;; The :init section is always executed.
    :init

    ;; Marginalia must be actived in the :init section of use-package such that
    ;; the mode gets enabled right away. Note that this forces loading the
    ;; package.
    (marginalia-mode))
#+end_src
** Embark
#+begin_src emacs-lisp
  (use-package embark
    :straight t
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)
     :map embark-org-link-map
     ("RET" . org-open-at-point-global)
     ("o"   . jv-org-open-link-string-in-side-window))
    ;; alternative for `describe-bindings'
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
    ;; strategy, if you want to see the documentation from multiple providers.
    (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)
    :config
    ;; Open the link in the side window using embark-act
    (defun jv-get-create-side-window ()
      "Return side window, or create one."
      (when (one-window-p)
        (split-window-horizontally))
      (or (window-in-direction 'right)
          (window-in-direction 'left)
          (selected-window)))
    ;; teach embark to visit org links:
    (defun embark-target-org-link-at-point ()
      "Teach embark to reconize org links at point."
      (when (org-in-regexp org-link-any-re)
        (cons 'org-link (match-string-no-properties 0))))
    (defun jv-org-open-link-string-in-side-window (s)
      (select-window (jv-get-create-side-window))
      (org-link-open-from-string s))

    (advice-add 'org-open-at-point-global :before #'push-mark)
    (add-to-list 'embark-target-finders
                 #'embark-target-org-link-at-point)
    (add-to-list 'embark-keymap-alist
                 '(org-link . embark-org-link-map))

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))
#+end_src
